<?php
/**
 * 新淘链商城
 * ============================================================================
 * 版权所有 2015-2027 新淘链，并保留所有权利。
 * 网站地址: 
 * ----------------------------------------------------------------------------
 * 这是一个商业软件，您必须购买授权才能使用.
 * 不允许对程序代码以任何形式任何目的的再发布。
 * 请支持正版, 以免引起不必要的法律纠纷.
 * ============================================================================
 * Author: 新淘链
 * Date: 2015-09-09
 */
namespace app\admin\model;
use think\Model;
class Order extends Model {
    //protected $tablePrefix = 'tp_';
//    protected $patchValidate = true; // 系统支持数据的批量验证功能，
//    protected $_validate = array(
//        array('consignee','require','收货人称必须填写！',1 ,'',3),  // 1 必须验证
//        array('address','require','地址必须填写',1,'',3), // 在新增的时候验证name字段是否唯一
//    );
}
